<?php

use Illuminate\Database\Seeder;
use App\Model\Admin\Page;
class PagesTableSeeder extends Seeder
{
    /**
     * Auto generated seed file
     *
     * @return void
     */
    public function run()
    {




        $list = array (
            0 =>
                array (
                    'id' => 1,
                    'title' => '公司简介',
                    'seotitle' => '',
                    'keywords' => '公司简介',
                    'template' => 'page',
                    'description' => 'LQYCMS企业网站管理系统采用PHP+Mysql架构，全站内置了SEO搜索引擎优化机制，支持用户自定义界面语言，拥有企业网站常用的模块功能（企业简介模块、新闻模块、产品模块、下载模块、图片模块、招聘模块、在线留言、反馈系统、在线交流、友情链接、会员与权限管理）。强大灵活的后台管理功能、静态页面生成功能、个性化模块添加功能、不同栏目自定义FLASH样式功能等可为企业打造出大气漂亮且具有营销力的',
                    'pubdate' => 1496540889,
                    'body' => '<p>我们专注于网络信息化及网络营销领域，通过整合团队专业的市场营销理念与网络技术为客户提供优质的网络营销服务。</p><p><br/></p><p>我们的主要业务包括：网站系统开发、网站建设、网站推广、空间域名以及网络营销策划与运行。</p><p><br/></p><p>我们主打产品——LQYCMS企业网站管理系统采用PHP+Mysql架构，全站内置了SEO搜索引擎优化机制，支持用户自定义界面语言，拥有企业网站常用的模块功能（企业简介模块、新闻模块、产品模块、下载模块、图片模块、招聘模块、在线留言、反馈系统、在线交流、友情链接、会员与权限管理）。强大灵活的后台管理功能、静态页面生成功能、个性化模块添加功能、不同栏目自定义FLASH样式功能等可为企业打造出大气漂亮且具有营销力的精品网站。</p><p><br/></p><p>我们秉承“为合作伙伴创造价值”的核心价值观，并以“诚实、宽容、创新、服务”为企业精神，通过自主创新和真诚合作为电子商务及信息服务行业创造价值。</p><p><br/></p><p><strong>关于“为合作伙伴创造价值”</strong></p><p><br/></p><p>我们认为客户、供应商、公司股东、公司员工等一切和自身有合作关系的单位和个人都是自己的合作伙伴，并只有通过努力为合作伙伴创造价值，才能体现自身的价值并获得发展和成功。</p><p><br/></p><p><strong>关于“诚实、宽容、创新、服务”</strong></p><p><br/></p><p>我们认为诚信是一切合作的基础，宽容是解决问题的前提，创新是发展事业的利器，服务是创造价值的根本。</p>',
                    'filename' => 'about',
                    'litpic' => '',
                    'click' => 393,
                    'listorder' => 50,
                ),
            1 =>
                array (
                    'id' => 2,
                    'title' => '联系我们',
                    'seotitle' => '',
                    'keywords' => '',
                    'template' => 'page',
                    'description' => '',
                    'pubdate' => 1496540844,
                    'body' => '<p>XX有限公司</p><p>地址：XX市XX区XXX号XXX栋XXX房</p><p>电话：0000-888888 13300000000</p><p>Q &nbsp;Q：374861669</p><p>邮编：000000</p><p>邮箱：374861669@</p><p>网址：www.1104.org</p>',
                    'filename' => 'contact',
                    'litpic' => '',
                    'click' => 259,
                    'listorder' => 50,
                ),
            2 =>
                array (
                    'id' => 3,
                    'title' => '企业文化',
                    'seotitle' => '',
                    'keywords' => '',
                    'template' => 'page',
                    'description' => '​企业文化，或称组织文化（Corporate Culture或Organizational Culture），是一个组织由其价值观、信念、仪式、符号、处事方式等组成的其特有的文化形象。',
                    'pubdate' => 1496541077,
                    'body' => '<p>企业文化，或称组织文化（Corporate Culture或Organizational Culture），是一个组织由其价值观、信念、仪式、符号、处事方式等组成的其特有的文化形象。<br/></p><p><br/></p><p>职工文化，也称企业职工文化，是与企业文化相对应的文化形态，职工文化以职工为本，是一种素质文化，企业文化以企业为本，是一种管理文化。</p><p>企业文化是在一定的条件下，企业生产经营和管理活动中所创造的具有该企业特色的精神财富和物质形态。它包括文化观念、价值观念、企业精神、道德规范、行为准则、历史传统、企业制度、文化环境、企业产品等。其中价值观是企业文化的核心。</p><p><br/></p><p>企业文化是企业的灵魂，是推动企业发展的不竭动力。它包含着非常丰富的内容，其核心是企业的精神和价值观。这里的价值观不是泛指企业管理中的各种文化现象，而是企业或企业中的员工在从事商品生产与经营中所持有的价值观念。</p>',
                    'filename' => 'culture',
                    'litpic' => '',
                    'click' => 264,
                    'listorder' => 50,
                ),
            3 =>
                array (
                    'id' => 4,
                    'title' => '招贤纳士',
                    'seotitle' => '',
                    'keywords' => '',
                    'template' => 'page',
                    'description' => '',
                    'pubdate' => 1496541317,
                    'body' => '<p><strong>PHP技术支持</strong></p><p><br/></p><p>主要工作内容：</p><p>1. 负责MetInfo企业网站管理系统技术支持；</p><p>2. 为客服人员提供技术支持；</p><p>&nbsp;</p><p>岗位要求：&nbsp;</p><p><br/></p><p>php能看懂且对PHP感兴趣，理解面向对象基本概念，写过一些小程序；</p><p>懂MySql数据库备份、恢复等基本操作，熟悉PHP环境的搭建和配置；</p><p>javascript能看懂，了解jquery等js框架；</p><p>html/css会写，懂linux的优先；</p><p>擅长网上查找资料解决问题；</p><p>有PHP作品（留言板，blog等）的优先；</p><p>做事要有耐心，性格谦和，学习能力强，能吃苦耐劳，愿意同公司共同发展。</p><p>如果你对我们的职位感兴趣，且符合我们的基本要求，请将个人简历投递至xxx@qq.com，或者直接与我们取得联系！</p><p><br/></p><p><br/></p><p><strong>网络销售</strong></p><p><br/></p><p>大专以上学历，一年以上网络销售经验；</p><p>熟悉网络推广，熟悉网站建设基本流程；</p><p>有网站制作相关工作经验者优先；</p><p>学习能力强，能吃苦耐劳，愿意同公司共同发展；</p><p>本岗位招收兼职，投递简历时请说明自己的工作意愿；</p><p>如果你对我们的职位感兴趣，且符合我们的基本要求，请将个人简历投递至xxx@qq.com，或者直接与我们取得联系！</p><p><br/></p><p><br/></p><p><strong>网页UI设计师</strong></p><p><br/></p><p>主要工作内容：负责MetInfo界面和公司网站的界面设计等，重视用户体验。</p><p><br/></p><p>岗位要求：</p><p>视觉设计、平面设计或美术相关专业，大专以上学历。</p><p>具有良好的创意设计能力及良好的色彩感，有较高的美术功底，较强的网页设计能力和整体布局感。</p><p>精通photoshop、Illustrator、Fireworks、Dreamweaver等图形设计工具中至少两种。</p><p>了解网页交互设计知识，对作品有不断追求完美的精神特质。</p><p>有网站UI设计同等职位工作经验、能提供过往作品者优先。</p>',
                    'filename' => 'jobs',
                    'litpic' => '',
                    'click' => 460,
                    'listorder' => 50,
                ),
            4 =>
                array (
                    'id' => 5,
                    'title' => '用户注册协议',
                    'seotitle' => '用户注册协议',
                    'keywords' => '',
                    'template' => 'page',
                    'description' => '',
                    'pubdate' => 1519694248,
                    'body' => '<p>尊敬的客户，欢迎您注册成为本网站用户，在注册前请仔细阅读如下服务条款。本协议双方为用户与公司，适用于用户注册使用本网站服务的全部活动。<br/></p><p><br/></p><p>在注册本网站之前，请您务必认真阅读并充分理解本协议全部内容。您点击本协议下方的“注册”按钮，并按照本网站注册程序成功成为注册为用户，即视为您已经充分理解和同意本协议全部内容，并签署了本协议，本协议立即在您与本公司之间产生合同法律效力，您使用本网站服务的全部活动将受到本协议的约束并应承担相应的责任和义务。</p><p><br/></p><p><strong>1、协议组成说明</strong></p><p><br/></p><p>1.1本协议的内容包括本协议以下全部条款以及本网站已经公示发布的及将来可能公示发布的各项规则，该等规则均为本协议不可分割的一部分，与本协议以下所列条款具有同等法律效力。</p><p><br/></p><p>1.2本网站有权根据需要修改本协议的内容。如以下条款或本网站各项规则有任何变更，本网站将在网站上刊载公告，不再向用户作个别通知。经修订的相关条款和规则一经公告，即于公告规定的特定生效日期自动生效。请您及时关注本网站关于相关条款和规则的公告，如不同意该变更，请您在变更公告刊载之日起72小时内以您在本网站注册时提供的个人邮箱向本网站公布的的服务邮箱发送邮件或拨打客服电话表明希望终止本协议（&quot;注册终止申请&quot;），本网站确认收到您的邮件和电话后将与您协商本协议终止后双方义务的履行。如您在本条所述时限内未发送注册终止申请，则本条所述时限届满之时，视为您已经同意接受该等变更，并应遵照修改后的协议履行应尽义务，经修订的相关条款和规则一经公告，即于公告规定的特定生效日期自动生效并对您产生法律约束力。</p><p><br/></p><p>1.3本协议不涉及您与本网站的其他用户之间因网上交易而产生的法律关系及法律纠纷。但您在此不可撤销地同意，您将全面接受并履行与本网站其他用户在本网站签订的任何电子法律文本，并承诺按照该法律文本享有和（或）放弃相应的权利、承担和（或）豁免相应的义务。</p><p><br/></p><p><strong>2、用户注册需知</strong></p><p><br/></p><p>2.1注册成为本网站用户必须满足如下主体资格条件：您必须是中国大陆公民，年龄在18周岁以上，且具有完全的民事权利能力及民事行为能力。如不具备上述资格，您应立即停止在本网站的注册程序、停止使用本网站服务，若违反前述规定注册使用本网站服务，本网站有权随时终止您的注册进程及本网站服务，并保留终止您的用户资格、追究您或您的监护人相关法律责任的权利。</p><p><br/></p><p>2.2在注册时和使用本网站服务的所有期间，您应根据本网站的要求提供您自身的真实资料和信息，并保证自注册之时起至使用本网站服务的所有期间，其所提交的所有资料和信息（包括但不限于真实姓名、电子邮件地址、联系电话、个人身份信息等）真实、准确、完整、有效和合法，复印件与原件一致，并如有变更，请及时更新，如因用户未及时更新信息和资料导致本网站无法向用户提供服务或发生错误，由此产生的法律责任和后果由用户自己承担。如使用他人信息和文件注册使用本网站服务或向本网站提供的信息和资料不符合上述规定，由此引起的一切责任和后果均由用户本人全部承担，本公司及本网站不因此承担任何法律责任，如因此而给本公司及本网站造成损失，用户应当承担赔偿本公司及本网站损失的责任。</p><p><br/></p><p><strong>3、服务变更、中断或终止</strong></p><p><br/></p><p>3.1鉴于网络服务的特殊性，用户同意本网站有权随时变更、中断或终止部分或全部的网络服务（包括收费网络服务）。如变更、中断或终止的网络服务属于免费网络服务，本网站无需通知用户，也无需对任何用户或任何第三方承担任何责任；如变更、中断或终止的网络服务属于收费网络服务，本网站应当在变更、中断或终止之前事先通知用户，并应向受影响的用户提供等值的替代性的收费网络服务，如用户不愿意接受替代性的收费网络服务，就该用户已经向本网站支付的服务费，本网站应当按照该用户实际使用相应收费网络服务的情况扣除相应服务费之后将剩余的服务费退还给该用户。</p><p><br/></p><p>3.2用户理解，本网站需要定期或不定期地对提供网络服务的平台（如互联网网站、移动网络等）或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，本网站无需为此承担任何责任，但本网站应尽可能事先进行通告。</p><p><br/></p><p><strong>4、用户使用规则</strong></p><p><br/></p><p>4.1您不得利用本网站或本网站服务从事任何不符合中国法律法规或侵犯他人权益的活动。不得自行发布、转载、传送含有下列内容之一的信息，本网站在发现您从事该等活动和发布信息时，有权基于本网站的独立判断直接删除您在本网站上作出的相关信息，有权不经通知而立即停止您对本网站的全部或部分功能的使用（包括但不限于中止、终止、限制您使用本网站服务）而无需通知您，亦无需承担任何责任。如因此而给本公司及本网站造成损失的，应当赔偿本公司及本网站的损失。</p><p><br/></p><p>（1）违反宪法确定的基本原则的；</p><p><br/></p><p>（2）危害国家安全，泄露国家机密，颠覆国家政权，破坏国家统一的；</p><p><br/></p><p>（3）损害国家荣誉和利益的；</p><p><br/></p><p>（4）煽动民族仇恨、民族歧视，破坏民族团结的；</p><p><br/></p><p>（5）破坏国家宗教政策，宣扬邪教和封建迷信的；</p><p><br/></p><p>（6）散布谣言，扰乱社会秩序，破坏社会稳定的；</p><p><br/></p><p>（7）散布淫秽、色情、赌博、暴力、恐怖或者教唆犯罪的；</p><p><br/></p><p>（8）侮辱或者诽谤他人，侵害他人合法权益的；</p><p><br/></p><p>（9）煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的；</p><p><br/></p><p>（10）以非法民间组织名义活动的；</p><p><br/></p><p>（11）含有法律、行政法规禁止的其他内容的。</p><p><br/></p><p>4.2在使用本网站时，您不得违反下述规定，如有违反任意一条，本网站基于本网站的独立判断直接删除您在本网站上作出的相关信息，有权要求您改正或直接采取必要的措施禁止（包括但不限于中止、终止、限制您使用本网站服务）而无需通知您，亦无需承担任何责任。如因此而给本公司及本网站造成损失的，您应当赔偿本公司及本网站的损失。</p><p><br/></p><p>（1）不得为任何非法目的而使用网络服务系统；</p><p><br/></p><p>（2）遵守所有与网络服务有关的网络协议、规定和程序；</p><p><br/></p><p>（3）不得利用本网站进行任何可能对互联网的正常运转造成不利影响的行为；</p><p><br/></p><p>（4）不得利用本网站进行任何不利于本网站或侵犯本公司利益的行为或言论。</p><p><br/></p><p>4.3账户安全及管理：</p><p><br/></p><p>4.3.1您在注册时向本网站提交的电子邮箱、用户名、密码及安全问题答案是您在本网站的唯一识别信息。您注册成功后，您应当妥善保管自己的用户名和密码，并对自己的用户名及密码安全性负责，不得将注册的电子邮箱、用户名、密码及安全问题答案转让、赠与或授权给第三方使用。您确认使用您的用户名和密码登陆本网站后在本网站的一切行为以及以您在本网站注册时提交的个人电子邮箱发送邮件的行为均代表您本人，并由您承担相应的法律后果，本公司及本网站不承担任何责任。</p><p><br/></p><p>4.3.2协助义务：您如发现有第三人冒用或盗用您账户及密码，或其他任何未经合法授权的情形，应立即以有效方式通知本网站，要求本网站暂停相关服务，否则由此产生的一切责任由您本人承担。同时，您理解本网站对您的请求采取行动需要合理期限，在此之前，本网站对第三人使用该服务所导致的损失不承担任何责任。</p><p><br/></p><p>4.3.3本网站有权基于单方独立判断，在其认为可能发生危害交易安全等情形时，不经通知而先行暂停、中断或终止向您提供本协议项下的全部或部分服务（包括收费服务），并将注册资料移除或删除，且无需对您或任何第三方承担任何责任。前述情形包括但不限于：</p><p><br/></p><p>（1）本网站认为您提供的个人资料不具有真实性、有效性或完整性；</p><p><br/></p><p>（2）本网站发现异常交易或有疑义或有违法之虞时；</p><p><br/></p><p>（3）本网站认为您的账户涉嫌洗钱、套现、传销、被冒用或其他本网站认为有风险之情形；</p><p><br/></p><p>（4）本网站认为您已经违反本协议中规定的各类规则及精神；</p><p><br/></p><p>（5）您在使用本网站收费服务时未按规定向本公司（含关联企业）支付相应的服务费用；</p><p><br/></p><p>（6）用户账户已连续三年内未实际使用且账户中余额为零；</p><p><br/></p><p>（7）本网站基于交易安全等原因，根据其单独判断需先行暂停、中断或终止向您提供本协议项下的全部或部分用户服务（包括收费服务），并将注册资料移除或删除的其他情形。</p><p><br/></p><p>4.3.4您同意，在必要时，本网站无需进行事先通知即有权终止提供用户账户服务，并可能立即暂停、关闭或删除您账户及该用户账户中所有相关资料及档案。</p><p><br/></p><p>4.4知识产权：</p><p><br/></p><p>4.4.1本网站的所有内容，包括但不限于文本、数据、图片、音频、视频、源代码和其他所有信息，均由本公司及本网站享有知识产权。未经本网站事先书面同意，不得复制、模仿、改编、传播、公布、展示或以任何其他方式侵犯本网站的知识产权。未经本公司书面同意,您不得将本网站包含的资料等任何内容发布到任何其他网站或者服务器。任何未经授权对本网站内容的使用均属于违法行为,本公司有权追究法律责任。注册用户未经本网站的明确书面同意不许下载（除了页面缓存）或修改平台或其任何部分。</p><p><br/></p><p><strong>5、用户隐私保护及授权</strong></p><p><br/></p><p>5.1您同意本网站在业务运营中收集和储存您的用户信息，包括但不限于您自行提供的资料和信息，以及本网站自行收集、取得的您在本网站的交易记录和使用信息等。本网站收集和储存您的用户信息的主要目的在于提高为您提供服务的效率和质量。</p><p><br/></p><p>5.2本网站不对外公开或第三方提供单个用户的注册资料及用户在使用网络服务时存储在本网站的非公开内容，但下列情况除外：</p><p><br/></p><p>（1）事先获得用户的明确授权；</p><p><br/></p><p>（2）根据有关的法律法规要求；</p><p><br/></p><p>（3）按照相关政府主管部门的要求；</p><p><br/></p><p>（4）为维护社会公众的利益。</p><p><br/></p><p>5.3本网站可能会与第三方合作向用户提供相关的网络服务，在此情况下，如该第三方同意承担与本站同等的保护用户隐私的责任，则本站有权将用户的注册资料等提供给该第三方。</p><p><br/></p><p>5.4本网站按照您在本网站上的行为自动追踪关于您的某些资料。在不透露注册用户的隐私资料的前提下，本网站有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</p><p><br/></p><p>5.5您同意，本公司及本网站可在本网站平台的某些网页上使用数据收集装置。</p><p><br/></p><p><strong>6、责任限制</strong></p><p><br/></p><p>6.1基于互联网的特殊性，本公司无法保证本网站的服务不会中断，对于包括但不限于本公司、本网站及相关第三方的设备、系统存在缺陷，计算机发生故障、遭到病毒、黑客攻击或者发生地震、海啸等不可抗力而造成服务中断或因此给您造成的损失，本公司不承担任何责任，有关损失由您自己承担。</p><p><br/></p><p>6.2本公司无义务监测本网站内容。您对于本网站披露的信息、选择使用本网站提供的服务，选择参与交易等，应当自行判断真实性和承担风险，由此而产生的法律责任和后果由您自己承担，本公司不承担任何责任。</p><p><br/></p><p>6.3与本公司合作的第三方机构向您提供的服务由第三方机构自行负责，本公司不对此等服务承担任何责任。</p><p><br/></p><p>6.4本网站的内容可能涉及第三方所有的信息或第三方网站，该等信息或第三方网站的真实性、可靠性、有效性等由相关第三方负责，您对该等信息或第三方网站自行判断并承担风险，与本网站和本公司无关。</p><p><br/></p><p>6.5无论如何，本公司对您承担的违约赔偿（如有）总额不超过向您收取的服务费用总额。</p><p><br/></p><p><strong>7、风险提示</strong></p><p><br/></p><p>7.1您了解并认可，任何通过本网站进行的交易并不能避免以下风险的产生，本网站不能也没有义务为如下风险负责：</p><p><br/></p><p>（1）宏观经济风险：因宏观经济形势变化，可能引起价格等方面的异常波动，您有可能遭受损失；</p><p><br/></p><p>（2）政策风险：有关法律、法规及相关政策、规则发生变化，可能引起价格等方面异常波动，您有可能遭受损失；</p><p><br/></p><p>（3）违约风险：因其他交易方无力或无意愿按时足额履约，您有可能遭受损失；</p><p><br/></p><p>（4）利率风险：市场利率变化可能对购买或持有产品的实际收益产生影响；</p><p><br/></p><p>（5）不可抗力因素导致的风险；</p><p><br/></p><p>（6）因您的过错导致的任何损失，该过错包括但不限于：操作不当、遗忘或泄露密码、密码被他人破解、您使用的计算机系统被第三方侵入、您委托他人代理交易时他人恶意或不当操作而造成的损失。</p><p><br/></p><p>7.2除按照规则运作还款风险金外（还款风险金规则以本网站最新公告为准），本网站不对任何您及/或任何交易提供任何担保或条件，无论是明示、默示或法定的。本网站不能也不试图对您发布的信息进行控制，对该等信息，本网站不承担任何形式的证明、鉴定服务。本网站不能完全保证平台内容的真实性、充分性、可靠性、准确性、完整性和有效性，并且无需承担任何由此引起的法律责任。您依赖于您的独立判断进行交易，您应对其作出的判断承担全部责任。</p><p><br/></p><p>7.3以上并不能揭示您通过本网站进行交易的全部风险及市场的全部情形。您在做出交易决策前，应全面了解相关交易，谨慎决策，并自行承担全部风险。</p><p><br/></p><p><strong>8、其他</strong></p><p><br/></p><p>8.1本协议的订立、执行、解释及争议解决均适用中华人民共和国法律（不包括香港、澳门、台湾地区）。本协议条款具有可分性，部分无效不影响其它部门效力。本网站对本协议拥有最终的解释权。</p><p><br/></p><p>8.2如果你是本网站注册用户，本协议条款将对您持续有效，有效期至您注销或者被关闭账户后。</p>',
                    'filename' => 'agreement',
                    'litpic' => '',
                    'click' => 300,
                    'listorder' => 50,
                ),
            5 =>
                array (
                    'id' => 6,
                    'title' => '帮助中心',
                    'seotitle' => '',
                    'keywords' => '帮助中心',
                    'template' => 'page',
                    'description' => '帮助中心',
                    'pubdate' => 1522409345,
                    'body' => '<p>帮助中心</p>',
                    'filename' => 'help',
                    'litpic' => '',
                    'click' => 226,
                    'listorder' => 50,
                ),
        );

        foreach ($list as $value){
            Page::create($value);
         }

    }
}
